app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES ('Tesst', 'Testing ', '2025-07-11 12:06:37.187365', '2025-07-11 12:06:37.187365') RETURNING "id"